In [27]:
import numpy as np
import pandas as pd
import warnings

In [28]:
warnings.filterwarnings('ignore')

In [53]:
columns = ["user_id","item_id","rating","timestamp"]
df = pd.read_csv("C:/Users/HP/Desktop/ml-100k/u.data", sep='\t',names=columns)

In [54]:
df.head()

   user_id  item_id  rating  timestamp
0      196      242       3  881250949
1      186      302       3  891717742
2       22      377       1  878887116
3      244       51       2  880606923
4      166      346       1  886397596

In [55]:
df.shape

(100000, 4)

In [56]:
df['user_id'].nunique()

943

In [57]:
df['item_id'].nunique()

1682

In [58]:
movies_title = pd.read_csv("C:/Users/HP/Desktop/ml-100k/u.item", sep="|", header=None, encoding='latin1')

In [59]:
movies_title.shape

(1682, 24)

In [60]:
movies_title = movies_title[[0,1]]

In [61]:
movies_title.columns = ['item_id','title']

In [62]:
movies_title.head()

   item_id              title
0        1   Toy Story (1995)
1        2   GoldenEye (1995)
2        3  Four Rooms (1995)
3        4  Get Shorty (1995)
4        5     Copycat (1995)

In [63]:
df = pd.merge(df, movies_title, on='item_id')

In [64]:
df.tail()

,user_id,item_id,rating,timestamp,title
99995,840,1674,4,891211682,Mamma Roma (1962)
99996,655,1640,3,888474646,"Eighth Day, The (1996)"
99997,655,1637,3,888984255,Girls Town (1996)
99998,655,1630,3,887428735,"Silence of the Palace, The (Saimt el Qusur) (1..."
99999,655,1641,3,887427810,Dadetown (1995)

# Exploratory Data Analysis

In [65]:
import matplotlib.pyplot as plt
import seaborn as sns
sns.set_style('white')

In [69]:
df.groupby('title').mean()['rating'].sort_values(ascending=False)

title
They Made Me a Criminal (1939)                  5.0
Marlene Dietrich: Shadow and Light (1996)       5.0
Saint of Fort Washington, The (1993)            5.0
Someone Else's America (1995)                   5.0
Star Kid (1997)                                 5.0
                                               ...
Eye of Vichy, The (Oeil de Vichy, L') (1993)    1.0
King of New York (1990)                         1.0
Touki Bouki (Journey of the Hyena) (1973)       1.0
Bloody Child, The (1996)                        1.0
Crude Oasis, The (1995)                         1.0
Name: rating, Length: 1664, dtype: float64